function Dsy(){
    this.Items = {};
}
Dsy.prototype.add = function(id,iArray){
    this.Items[id] = iArray;
}
Dsy.prototype.Exists = function(id) {
    if(typeof(this.Items[id]) == "undefined")
        return false;
    return true;
}
function change(v) {
    var str="0";
    for(i=0;i<v;i++) {
        str+=("_"+(document.getElementById(s[i]).selectedIndex-1));
    };
    var ss=document.getElementById(s[v]);
    with(ss) {
        length = 0;
        options[0]=new Option(opt0[v],opt0[v]);
        if(v && document.getElementById(s[v-1]).selectedIndex>0 || !v) {
            if(dsy.Exists(str)){
                ar = dsy.Items[str];
                for(i=0;i<ar.length;i++)
                    options[length]=new Option(ar[i],ar[i]);
                if(v) options[1].selected = true;
            }
        }
        if(++v<s.length) {
            change(v);
        }
    }
}
var dsy = new Dsy();
dsy.add("0",["大陆","海洋"]);

dsy.add("0_0",["亚洲","美洲","欧洲","大洋洲","非洲"]);
dsy.add("0_1",["亚洲","美洲","欧洲","大洋洲","非洲"]);

dsy.add("0_0_0",["中华人民共和国","日本","韩国","土耳其"]);
dsy.add("0_0_0_0",["北京市","上海市","广东省","浙江省","云南省","台湾省"]);
dsy.add("0_0_0_0_0",["北京首都机场","北京站","丰台站","丰台西站"]);
dsy.add("0_0_0_0_1",["上海浦东国际机场","上海虹桥国际机场","上海港","上海站","虹桥火车站","南翔站","北郊站"]);
dsy.add("0_0_0_0_2",["广州白云国际机场","深圳宝安国际机场","广州港","深圳北站","广州站","广州南站","广州东站","江村站"]);
dsy.add("0_0_0_0_3",["深圳港"]);
dsy.add("0_0_0_0_4",["昆明长水国际机场","昆明东站"]);
dsy.add("0_0_0_0_5",["台北桃园机场","高雄港"]);

dsy.add("0_0_0_1",["东京市","关东地区"]);
dsy.add("0_0_0_1_0",[""]);
dsy.add("0_0_0_1_1",[""]);

dsy.add("0_0_0_2",["首尔","釜山","仁川市"]);
dsy.add("0_0_0_2_0",[""]);
dsy.add("0_0_0_2_1",[""]);
dsy.add("0_0_0_2_2",[""]);

dsy.add("0_0_0_3",["土耳其","伊斯坦布尔"]);
dsy.add("0_0_0_3_0",[""]);
dsy.add("0_0_0_3_1",[""]);

dsy.add("0_0_1",["美国","加拿大","墨西哥","巴西","巴拿马共和国","厄瓜多尔共和国","秘鲁","智利"]);
dsy.add("0_0_1_0",["佐治亚州","洛杉矶市","芝加哥市","德克萨斯州"]);
dsy.add("0_0_1_0_0",["亚特兰大机场"]);
dsy.add("0_0_1_0_1",["洛杉矶国际机场"]);
dsy.add("0_0_1_0_2",["芝加哥奥黑尔机场"]);
dsy.add("0_0_1_0_3",["达拉斯机场","休斯敦机场"]);

dsy.add("0_0_1_1",["多伦多","温哥华"]);
dsy.add("0_0_1_1_0",["多伦多机场"]);
dsy.add("0_0_1_1_1",[""]);

dsy.add("0_0_1_2",["墨西哥"]);
dsy.add("0_0_1_2_0",["墨西哥机场"]);

dsy.add("0_0_1_3",["圣保罗州"]);
dsy.add("0_0_1_3_0",["圣保罗机场"]);

dsy.add("0_0_1_4",["巴拿马共和国"]);
dsy.add("0_0_1_4_0",[""]);

dsy.add("0_0_1_5",[""]);
dsy.add("0_0_1_5_0",[""]);

dsy.add("0_0_1_6",["秘鲁"]);
dsy.add("0_0_1_6_0",[""]);
dsy.add("0_0_1_7",["智利"]);
dsy.add("0_0_1_7_0",[""]);

dsy.add("0_0_2",["英国","法国","德国","意大利"]);
dsy.add("0_0_2_0",["伦敦市","爱尔兰","伦敦"]);
dsy.add("0_0_2_0_0",["伦敦希斯罗机场"]);
dsy.add("0_0_2_0_1",["德里城市机场"]);
dsy.add("0_0_2_0_2",["伦敦盖特威克机场"]);

dsy.add("0_0_2_1",["巴黎"]);
dsy.add("0_0_2_1_0",["巴黎戴高乐机场"]);

dsy.add("0_0_2_2",["黑森州","慕尼黑","不来梅州","汉堡"]);
dsy.add("0_0_2_2_0",["法兰克福机场"]);
dsy.add("0_0_2_2_1",["慕尼黑机场"]);
dsy.add("0_0_2_2_2",["不来梅港"]);
dsy.add("0_0_2_2_3",["汉堡港"]);

dsy.add("0_0_2_3",[""]);
dsy.add("0_0_2_3_0",[""]);

dsy.add("0_0_3",["澳大利亚","新西兰","斐济"]);
dsy.add("0_0_3_0",["悉尼"]);
dsy.add("0_0_3_0_0",["悉尼机场"]);

dsy.add("0_0_3_1",["新西兰"]);
dsy.add("0_0_3_1_0",[""]);
dsy.add("0_0_3_2",[""]);
dsy.add("0_0_3_2_0",[""]);

dsy.add("0_0_4",["摩洛哥","肯尼亚","坦桑尼亚","南非"]);
dsy.add("0_0_4_0",["丹吉尔省"]);
dsy.add("0_0_4_0_0",["丹吉尔港"]);

dsy.add("0_0_4_1",[""]);
dsy.add("0_0_4_1_0",[""]);

dsy.add("0_0_4_2",[""]);
dsy.add("0_0_4_2_0",[""]);

dsy.add("0_0_4_3",[""]);
dsy.add("0_0_4_3_0",[""]);





dsy.add("0_1_0",["中华人民共和国","日本","韩国","土耳其"]);
dsy.add("0_1_0_0",["北京市","上海市","广东省","浙江省","云南省","台湾省"]);
dsy.add("0_1_0_0_0",[""]);
dsy.add("0_1_0_0_1",["上海港"]);
dsy.add("0_1_0_0_2",["广州港"]);
dsy.add("0_1_0_0_3",["深圳港"]);
dsy.add("0_1_0_0_4",[""]);
dsy.add("0_1_0_0_5",["高雄港"]);

dsy.add("0_1_0_1",["东京市","关东地区"]);
dsy.add("0_1_0_1_0",[""]);
dsy.add("0_1_0_1_1",[""]);

dsy.add("0_1_0_2",["首尔","釜山","仁川市"]);
dsy.add("0_1_0_2_0",[""]);
dsy.add("0_1_0_2_1",[""]);
dsy.add("0_1_0_2_2",[""]);

dsy.add("0_1_0_3",["土耳其","伊斯坦布尔"]);
dsy.add("0_1_0_3_0",[""]);
dsy.add("0_1_0_3_1",[""]);

dsy.add("0_1_1",["美国","加拿大","墨西哥","巴西","巴拿马共和国","厄瓜多尔共和国","秘鲁","智利"]);
dsy.add("0_1_1_0",["佐治亚州","洛杉矶市","芝加哥市","德克萨斯州"]);
dsy.add("0_1_1_0_0",["亚特兰大机场"]);
dsy.add("0_1_1_0_1",["洛杉矶国际机场"]);
dsy.add("0_1_1_0_2",["芝加哥奥黑尔机场"]);
dsy.add("0_1_1_0_3",["达拉斯机场","休斯敦机场"]);

dsy.add("0_1_1_1",["多伦多","温哥华"]);
dsy.add("0_1_1_1_0",["多伦多机场"]);
dsy.add("0_1_1_1_1",[""]);

dsy.add("0_1_1_2",["墨西哥"]);
dsy.add("0_1_1_2_0",["墨西哥机场"]);

dsy.add("0_1_1_3",["圣保罗州"]);
dsy.add("0_1_1_3_0",["圣保罗机场"]);

dsy.add("0_1_1_4",["巴拿马共和国"]);
dsy.add("0_1_1_4_0",[""]);

dsy.add("0_1_1_5",[""]);
dsy.add("0_1_1_5_0",[""]);

dsy.add("0_1_1_6",["秘鲁"]);
dsy.add("0_1_1_6_0",[""]);
dsy.add("0_1_1_7",["智利"]);
dsy.add("0_1_1_7_0",[""]);

dsy.add("0_1_2",["英国","法国","德国","意大利"]);
dsy.add("0_1_2_0",["伦敦市","爱尔兰","伦敦"]);
dsy.add("0_1_2_0_0",["伦敦希斯罗机场"]);
dsy.add("0_1_2_0_1",["德里城市机场"]);
dsy.add("0_1_2_0_2",["伦敦盖特威克机场"]);

dsy.add("0_1_2_1",["巴黎"]);
dsy.add("0_1_2_1_0",["巴黎戴高乐机场"]);

dsy.add("0_1_2_2",["黑森州","慕尼黑","不来梅州","汉堡"]);
dsy.add("0_1_2_2_0",["法兰克福机场"]);
dsy.add("0_1_2_2_1",["慕尼黑机场"]);
dsy.add("0_1_2_2_2",["不来梅港"]);
dsy.add("0_1_2_2_3",["汉堡港"]);

dsy.add("0_1_2_3",[""]);
dsy.add("0_1_2_3_0",[""]);

dsy.add("0_1_3",["澳大利亚","新西兰","斐济"]);
dsy.add("0_1_3_0",["悉尼"]);
dsy.add("0_1_3_0_0",["悉尼机场"]);

dsy.add("0_1_3_1",["新西兰"]);
dsy.add("0_1_3_1_0",[""]);
dsy.add("0_1_3_2",["斐济"]);
dsy.add("0_1_3_2_0",[""]);

dsy.add("0_1_4",["摩洛哥","肯尼亚","坦桑尼亚","南非"]);
dsy.add("0_1_4_0",["丹吉尔省"]);
dsy.add("0_1_4_0_0",["丹吉尔港"]);

dsy.add("0_1_4_1",[""]);
dsy.add("0_1_4_1_0",[""]);

dsy.add("0_1_4_2",[""]);
dsy.add("0_1_4_2_0",[""]);

dsy.add("0_1_4_3",[""]);
dsy.add("0_1_4_3_0",[""]);









dsy.add("0_1_0",["中华人民共和国","日本","韩国","土耳其"]);
dsy.add("0_1_1",["美国","加拿大","墨西哥","巴西","巴拿马共和国","厄瓜多尔共和国","秘鲁","智利"]);
dsy.add("0_1_2",["英国","法国","德国","意大利"]);
dsy.add("0_1_3",["澳大利亚","新西兰","斐济"]);
dsy.add("0_1_4",["摩洛哥","肯尼亚","坦桑尼亚","南非"]);

dsy.add("0_1_0_0",["北京市","上海市","广东省","浙江省","云南省","台湾省"]);
dsy.add("0_1_0_1",["东京市","关东地区"]);
dsy.add("0_1_0_2",["首尔","釜山","仁川市"]);
dsy.add("0_1_0_3",["土耳其","伊斯坦布尔"]);

dsy.add("0_1_0_0",["北京市","上海市","广东省","浙江省","云南省","台湾省"]);
dsy.add("0_1_0_0_0",[""]);
dsy.add("0_1_0_0_1",["上海港"]);
dsy.add("0_1_0_0_2",["宁波-舟山港","广州港"]);
dsy.add("0_1_0_0_3",["深圳港"]);
dsy.add("0_1_0_0_4",[""]);
dsy.add("0_1_0_0_5",["高雄港"]);
dsy.add("0_1_0_1",["东京市","关东地区"]);
dsy.add("0_1_0_1_0",["东京港"]);
dsy.add("0_1_0_1_1",[""]);
dsy.add("0_1_0_2",["首尔","釜山","仁川市"]);
dsy.add("0_1_0_2_0",[""]);
dsy.add("0_1_0_2_1",["釜山港"]);
dsy.add("0_1_0_2_2",["仁川港"]);
dsy.add("0_1_0_3",["土耳其","伊斯坦布尔"]);
dsy.add("0_1_0_3_0",[""]);
dsy.add("0_1_0_3_1",["伊斯坦布尔港"]);
